{"pageProps":{"frontmatter":{"slug":"/blog/monorepo-vs-monolith","date":"2021-02-08","title":"Monorepo vs Monolith","socialImage":"social-img/monorepo-monolith.png","draft":false},"content":"Two words that start with Mono, which is means One.\n\nWhat it means is that all your code goes to same repository.\n\nOpposed to polyrepo, where your source code is distributed into several separate repositories.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/9JrQP90c45E\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\nNow the Monolith, is a word having same prefix as Monorepo, perhaps this is why is often confused,\nbut it means something different.\n\nMonolith describes a software product, that is shipped and deployed together.\n\nThis term comes from Microservices Architecture, but word monolith is defines something what is actually Opposite to a microservice.\n\nClearly Monolith and Monorepo, these are two different concepts, they may intersect, but essentially they describe two different qualities.\n\nWhen software consists of different components,\nthe way how it is organized in Version Control System may wary from Monorepo (all code is in one repository) to Polyrepo (each component has for it's repository).\n\nAnd then Monolith describes the way how the software is packaged, and shipped,-  which is one big deployment of software, no matter how many different responsibilities this package has, all is released in one go. It is opposed to microservices, where each of the microservice is deployed and released together.\n\nA software product may be described by both version-control and deployment strategies independently. Effectively, each software product may be organized in 4 different ways:\n\n## 1. Monolith Monorepo\n\nThis is the simplest one, all code from single repository is deployed together. Mostly used by small projects. The software may serve different responsibilities (like backend and frontend), yet it is all deployed together.\n\nPros:\n- Easy to navigate through the code\n- Simple deployment pipeline\n\nCons:\n- May be difficult to maintain when project goes big, and starts to serve multiple responsibilities.\n- Cannot scale deployment of different components independently\n\n## 2. Monolith Polyrepo\n\nThis is same as one above, but it uses libraries and modules stored in external repositories. Compared to Monolith Monorepo this may have cleaner smaller code bases in each repo, which makes it easier to maintain. But it is still deployed all together at once.\n\n## 3. Microservice Polyrepo\n\nHere the application is distributed, we have components deployed separately, but the all are stored in one repository.\n\nPros:\n- Small size of the components\n- Each component can be scaled independently\n- Relatively simple build pipelines\n\nCons:\n- It is not as easy to navigate through the code, or onboard new people\n\n## 4. Microservice Monorepo\n\nThere is only one repository, yet all the components clearly separated, so that they can be released together.\n\nPros:\n- Small size of the components\n- Each component can be scaled independently\n- Code is easy to navigate through\n- Onboarding of new team members is easier\n\nCons:\n- Build pipelines are more complicated, because not all of the CI/CD tools have out-of-box monorepo support\n"},"__N_SSG":true}