{"pageProps":{"frontmatter":{"slug":"/blog/why-use-bullet-journal","date":"2022-02-20","title":"Why should you use the Bullet Journal method?","socialImage":"social-img/bullet-journal.png","draft":false},"content":"\nDigital organizers and note-taking apps are great. Take a look at Google Keep, it can be used for note-taking and TODO lists as well. Like many others of this kind, Keep is interoperable with other applications, so you can copy-and-paste or share digital content across in many other ways. On top of that using a digital organizer, it is easy to access tasks and notes using any device as they are synchronized in the cloud.\n\n### Taking notes & tracking tasks\n\nThere are so many productivity tools and organizers, where most of them are focused on 2 main activities:\n\n- taking notes;\n- and tracking progress daily tasks.\n\nWith Google Keep you can stylishly perform those two activities, enriched with multimedia capabilities, and taking advantage of embedding other technologies in the interlinked digital world. Ok, but why those two activities are so crucial in being productive?\n\n### How does taking notes contribute to productivity?\n\nThere are several ways:\n- Stay Awake. Taking minutes during a meeting, or during a conversation writing down on important aspects makes you a better listener, because it forces you to keep the focus on the words you hear;\n\n- Remember. writing makes it easier to remember, as you repeat it in your mind slowly;\n- Revisit. You can always search and pull back these records in the future.\n\nAs an engineer, at work, I have a daily sync meeting with my team, where we revisit what we have been working on the previous day, and having the notes becoming very handy so that I can give my standup update in a concise and prepared way.\n\n### Why tracking tasks is so important?\n\nIt is all about prioritizing. When you have your open tasks listed nicely together, you can choose:\n\n- which tasks should be worked on first;\n- which tasks could be delayed or rescheduled;\n- which tasks you don't need to work on anymore at all.\n\nThe truth is, that time is a limited resource and not everything we want to do we can squeeze in.\n\n### Bullet Journal\n\nWhen Ryder Caroll first published his Bullet Journal method, it quickly became viral. It is a new approach to the good old idea of journaling using pen and paper. It consists of:\n\n- daily *Rapid Log* where it has listed all the open tasks for the day together with notes taken on that day;\n- also of Monthly Log;\n- and the Index Page describing on what pages to find the important stuff.\n\n### Rapid Log \nEach entry to this journal starts with a bullet describing the type of the entry. These are the different types of bullets that can be foungd in the Rapid Log:\n\n| Bullet | Meaning|\n|:------:|--------|\n| `-`    |is a note, it is just an observation of something happening now |\n| `◯`    |is an event or a meeting scheduled to happen on that day |\n| `•`    |an open task for the day that is not done yet, until the end of the day this bullet will change in one of the following: |\n| `╳`    |When the dot is crossed, it means the task is done |\n| `>`    |if the dot turns into a forward arrow, that means this task is delayed to tomorrow day |\n| `<`    |back arrow, means that is deprioritized and is to be rescheduled later and it is now moved to the monthly backlog |\n| ~~`•`~~| ~~some tasks just become irrelevant and can be decided not to be worked anymore, and they just die on that day being struck through~~ |\n\nFor example, the rapid log of a day may look like this:\n```\t\nTUE, 02/08/2020\n----------------\n◯ 11:00 AM Interview for FE dev position\n• Do the code review for the payment plugin\n╳ Make the Brochure Site layout more responsive on small screens\n• Submit the worksheet for the last week\n- Client support for the Delivery is not amazing\n- Brochure site changes are moved to the QA review\n```\n\n### Digital or paper?\n\nAlthough occasionally I also use Google Keep for a very similar purpose, my main journal is a paper notebook, which I keep filing every day. I prefer the paper version for the following reasons:\n\n- It is not nice to put a screen between me and somebody while having a conversation;\n- It is faster and requires no thinking to take notes;\n- I don't use an eraser, once a record is in the book is there, so it is not so easy to \"fake\" something, keeps the full record if some ideas changed meanwhile\n- Tangible paper book, motivates me better to keep my journaling habit going.\n- I can draw, and decorate it in an unrestricted way.\n\nAlso, the original Bullet Journal is always kept in a physical notebook.\nSo I also keep my daily writing with a pen habbit alive.\n"},"__N_SSG":true}